/*
 * 1. 데이터 관리 
 * 	  --------
 * 	  저장 => 변수 (한개) 배열 (여러개)
 * 					  ===============
 * 						| => 같은 데이터만 모아서 처리
 * 2. 요청 (사용자 요청) : 연산자/제어문
 * 	 => 로직
 *	 => 순서 => 알고리즘
 * 3. 결과값 출력
 * 		=> 암기(x) => 순서
 * // 생성 => 선언부
		/*
		 * 선언
		 *   1) 선언 후 초기값
		 *     int a;
		 *     a=10;
		 *   2) 선언과 동시에 초기값
		 *      int a=10;
		 *  ===================
		 *  1. 배열
		 *  	1) 선언관 동시에 초기화
		 *  		int[] arr={1,2,3,4,5,}
		 *  		int[] arr=new int[5] => 0 가장 많이 사용하는 방식
		 *  	2) 선언후에 초기화
		 *  	   int[] arr;
		 *  2. 처리 => 평균,총점 ...
		 *  3. 사용자가 볼 수 있게 출력	  
 * -----------------------------------------------------
 */
public class 배열_생성_11 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
	

	}

}




